# Gather Section (20 Questions, 40 Marks)

You should have access to a file called TMDB.db. The first step to answering this set of questions will be to connect to this db file to access the data. 

![SQL Architectures](https://raw.githubusercontent.com/Explore-AI/Public-Data/master/image/TMDB_ERD.JPG)

Before we start we need to load our SQL magic commands (we only need do this once per notebook):

In [2]:
%load_ext sql

*Note: we have to prepend a Jupyter notebook cell with `%%sql` in order to run a SQL query. Place your code in the '# Your code here' lines. If you experience trouble connecting to the .db file, please ensure that you have the `pymysql` and `ipython-sql` packages installed. Also ensure that `sqlalchemy` is pinned at a version <2.*


Based on that data, answer the following questions:


### Question 11
What is the code you can use to connect to the TMBD database that is saved in the same location with the Jupyter notebook?

In [ ]:
%%sql 
sqlite:///TMDB.db
SELECT * FROM ProductionCompanies

### Question 12
What is the primary key for the table “movies”?

### Question 13
How many foreign keys does the “languagemap” table have?

### Question 14
What code would you use to set up a view of all movies that did not get released?

In [ ]:
%%sql 
# Your code here

### Question 15
How would you select only the title, release date, and release status columns from the view you created in the previous question?

In [ ]:
%%sql 
# Your code here

### Question 16
How many movies are no longer using their original titles?

In [12]:
%%sql 

SELECT COUNT(*) AS different_titles_count
FROM Movies
WHERE title <> original_title;

 * sqlite:///TMDB.db
Done.

[(261,)]

### Question 17
What is the most popular movie that was made after 01/01/2000 with a budget of more than $100 000 000? (Hint: Use the popularity field in the Movies table. Larger numbers are more popular.)

In [13]:
%%sql 
SELECT title, popularity
FROM Movies
WHERE release_date > '2000-01-01' AND budget > 100000000
ORDER BY popularity DESC
LIMIT 1;

 * sqlite:///TMDB.db
Done.

[('Interstellar', 724.247784)]

### Question 18
How many movies are there that do not have English as their original language?

In [14]:
%%sql 
SELECT COUNT(*) AS non_english_movies_count
FROM Movies
WHERE original_language <> 'en';

 * sqlite:///TMDB.db
Done.

[(298,)]

### Question 19
How many movies in the database were produced by Pixar Animation Studios?

In [21]:
%%sql

 * sqlite:///TMDB.db
Done.

[(0, 'production_company_id', 'INTEGER', 1, None, 1),
 (1, 'production_company_name', 'varchar(500)', 0, 'NULL', 0)]

In [16]:
%%sql 
SELECT COUNT(*) AS pixar_movies_count
FROM Movies
WHERE ProductionCompanies LIKE '%Pixar Animation Studios%';

 * sqlite:///TMDB.db
(sqlite3.OperationalError) no such column: ProductionCompanies
[SQL: SELECT COUNT(*) AS pixar_movies_count
FROM Movies
WHERE ProductionCompanies LIKE '%Pixar Animation Studios%';]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

### Question 20
How many movies are in the database that are both a Romance and a Comedy?

In [32]:
%%sql
PRAGMA table_info(Genres);

 * sqlite:///TMDB.db
Done.

[(0, 'genre_id', 'INTEGER', 1, None, 1),
 (1, 'genre_name', 'varchar(50)', 0, 'NULL', 0)]

In [26]:
%%sql
PRAGMA table_info(Movies);

 * sqlite:///TMDB.db
Done.

[(0, 'movie_id', 'INTEGER', 1, None, 1),
 (1, 'title', 'varchar(500)', 0, 'NULL', 0),
 (2, 'release_date', 'datetime(6)', 0, 'NULL', 0),
 (3, 'budget', 'INTEGER', 0, 'NULL', 0),
 (4, 'homepage', 'varchar(500)', 0, 'NULL', 0),
 (5, 'original_language', 'varchar(50)', 0, 'NULL', 0),
 (6, 'original_title', 'varchar(500)', 0, 'NULL', 0),
 (7, 'overview', 'varchar(5000)', 0, 'NULL', 0),
 (8, 'popularity', 'double', 0, 'NULL', 0),
 (9, 'revenue', 'double', 0, 'NULL', 0),
 (10, 'runtime', 'double', 0, 'NULL', 0),
 (11, 'release_status', 'varchar(50)', 0, 'NULL', 0),
 (12, 'tagline', 'varchar(500)', 0, 'NULL', 0),
 (13, 'vote_average', 'double', 0, 'NULL', 0),
 (14, 'vote_count', 'INTEGER', 0, 'NULL', 0)]

In [37]:
%%sql 
SELECT COUNT(DISTINCT movie_id) AS romance_comedy_count
FROM Movies title
JOIN Genres genre_name ON movie_id = genre_id
WHERE genre_name IN ('Romance', 'Comedy')
GROUP BY movie_id
HAVING COUNT(DISTINCT genre_name) = 2;

 * sqlite:///TMDB.db
Done.

[]

### Question 21
What is the most popular action movie that has some German in it? (Hint: The German word for German is Deutsch)

In [ ]:
%%sql 
# Your code here

### Question 22
In how many movies did Tom Cruise portray the character Ethan Hunt?

In [ ]:
%%sql 
# Your code here

### Question 23 
How many times was the actress Cate Blanchett nominated for an Oscar?

In [ ]:
%%sql 
# Your code here

### Question 24
How many movies contain at least one of the official South African Languages, Afrikaans or Zulu?

In [ ]:
%%sql 
# Your code here

### Question 25
Which of the movies mentioned above is the most popular?

In [ ]:
%%sql 
# Your code here

### Question 26
What would be the code to change the name of the language with the ‘zh’ iso code in the “language” table to ‘Chinese’?

In [ ]:
%%sql 
# Your code here

### Question 27
What would be the code to insert a new genre called ‘Sport’ with an id of 10?

In [ ]:
%%sql 
# Your code here

### Question 28 
You have just watched The Flintstones movie and did not find it very funny. What code would delete the entry that links The Flintstones to the Comedy genre?

In [ ]:
%%sql 
# Your code here

### Question 29
What code will give the 10 most recently released movies in the database?

In [ ]:
%%sql 
# Your code here

### Question 30
What code would you use to add a column to the language table that could be used for the English names of the different languages?

In [ ]:
%%sql 
# Your code here